app/Models/Api/PostModel.php

    public function add($data) {

        $this->builder->insert($data);
---
INSERT INTO `posts` (`caption`, `chat_enabled`, `hashtag`, `hypertext`, `hyperlink`, `created_at`, `added_by`, `image`) VALUES ('this is my sample lipstick from hermes, i love it!', '1', '', '', '', 1695183658, '24', '1695183658_ad98312ab588a28df2ea.jpg')

    public function getPosts($pageIndex, $count, $userId, $fcount) {

        if ($fcount == 0) {

            $postData = $this->builder
                    ->where("(added_by IN (SELECT `target_id` FROM follow WHERE `user_id` = $userId) OR added_by = $userId)")
                    ->where('deleted', 0)
                    ->orderBy('likes', 'DESC')
                    ->get($count, $pageIndex * $count)
                    ->getResultArray();

            return $postData;
        } else {

            $postData = $this->builder
                    ->where("(added_by IN (SELECT `target_id` FROM follow WHERE `user_id` = $userId) OR added_by = $userId)")
                    ->where('deleted', 0)
                    ->orderBy('id', 'DESC')
                    ->get($count, $pageIndex * $count)
                    ->getResultArray();
---
SELECT *
FROM `posts`
WHERE (`added_by` IN (SELECT `target_id` FROM follow WHERE `user_id` = 56) OR `added_by` = 56)
AND `deleted` = 0
ORDER BY `likes` DESC, `id` DESC
 LIMIT 50
SELECT *
FROM `posts`
WHERE (`added_by` IN (SELECT `target_id` FROM follow WHERE `user_id` = 48) OR `added_by` = 48)
AND `deleted` = 0
ORDER BY `id` DESC
 LIMIT 50

    public function getById($id) {
        $post = $this->builder
                    ->where('id', $id)
                    ->where('deleted', 0)
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `posts`
WHERE `id` = '54'
AND `deleted` = 0

    public function getByUser($userId) {
        $postData = $this->builder
                ->where('added_by', $userId)
                ->where('deleted', 0)
                ->get()
                ->getResultArray();
---
SELECT *
FROM `posts`
WHERE `added_by` = '1'
AND `deleted` = 0

    function checkMyLike($userId, $postid) {
        $builder = $this->db->table('likes');
        $builder->where(['user_id' => $userId, 'post_id' => $postid]);
        return $builder->get()->getNumRows();
---
SELECT *
FROM `likes`
WHERE `user_id` = 64
AND `post_id` = '27'

    function setLike($data, $isLike) {

        $builder = $this->db->table('likes');
        $query = $builder->where($data)
                        ->get();
        if ($query->getNumRows() > 0) {
            if ($isLike == 0) {
                $builder->delete($data);
                $this->updateLikeCount($data['post_id'], $isLike);
            }
        } else {
            $builder->insert($data);
---
INSERT INTO `likes` (`user_id`, `post_id`) VALUES ('64', '54')

    function updateLikeCount($postId, $isLike) {

        if ($isLike == 1) {
            $this->builder->where('id', $postId);
            $this->builder->set('likes', 'likes + 1', FALSE);
            $this->builder->update();
        } else {
            $query = $this->builder->where('id', $postId)->get();
            if ($query->getNumRows() > 0) {
                $this->builder->where('id', $postId);
                $this->builder->set('likes', 'likes - 1', FALSE);
                $this->builder->update();
---
UPDATE `posts` SET `likes` = likes + 1
WHERE `id` = '54'
SELECT *
FROM `posts`
WHERE `id` = '32'
UPDATE `posts` SET `likes` = likes - 1
WHERE `id` = '32'

    function comments($postId) {
        $builder = $this->db->table('comments');
        return $builder->where('post_id', $postId)
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `comments`
WHERE `post_id` = '33'

    function otherPosts($userId) {

        $postData = $this->builder
                ->select('*')
                ->where('deleted', 0)
                ->where('added_by !=', $userId)
                ->orderBy('chat_enabled', 'DESC')
                ->orderBy('id', 'DESC')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `posts`
WHERE `deleted` = 0
AND `added_by` != 64
ORDER BY `chat_enabled` DESC, `id` DESC

    function likedPosts($userId, $pageIndex, $count) {

        $postData = $this->builder->select('posts.*')
                ->join('likes', 'posts.id = likes.post_id')
                ->where('posts.deleted', 0)
                ->where('likes.user_id', $userId)
                ->orderBy('likes.id', 'DESC')
                ->get($count, $pageIndex * $count)
                ->getResultArray();
---
SELECT `posts`.*
FROM `posts`
JOIN `likes` ON `posts`.`id` = `likes`.`post_id`
WHERE `posts`.`deleted` = 0
AND `likes`.`user_id` = '64'
ORDER BY `likes`.`id` DESC
 LIMIT 50