app/Models/Api/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'hello@gmail.com'
---
    public function checkExist($email = "") {

        if ($email != "") {
            $query = $this->builder->getWhere(['email' => $email]);

SELECT *
FROM `users`
WHERE `username` = 'miromie_m'
---
    public function checkUserNameExist($username = "") {

        if ($username != "") {
            $query = $this->builder->getWhere(['username' => $username]);

INSERT INTO `users` (`pronouns`, `styles`, `username`, `email`, `password`, `device_type`, `created_at`) VALUES ('She', 'Basic,Athleisure,Hype,Beach,Boho,Vintage', 'miromie_m', 'hello@gmail.com', '$2y$10$RYWVc2JA76hVoofj9Q3YXub7Zkra8h2AjtqNVDk9hcjeCuZMqfhKW', 'iOS', '2023-09-20 16:04:37')
---
    function signup($data) {

        if ($this->checkExist($data['email']) !== false) {
            return -1;
        }

        if ($this->checkUserNameExist($data['username']) !== false) {
            return -2;
        }

        if ($this->builder->insert($data)) {

SELECT *
FROM `users`
WHERE `id` = '64'
---
    function getUserById($id) {

        return $this->builder
                ->where('id', $id)
                ->get()
                ->getRowArray();

SELECT *
FROM `follow`
WHERE `user_id` = '1'
AND `target_id` = '1'
---
    function checkMyFollow($myId, $userId) {
        $builder = $this->db->table('follow');
        $builder->where('user_id', $myId);
        $builder->where('target_id', $userId);
        return $builder->get()->getNumRows();

INSERT INTO `notifications` (`user_id`, `post_id`, `sent_by`, `notification_type`, `content`, `created_at`) VALUES ('65', '54', '64', 'like', 'miromietest_27 liked your post', '2023-09-20 16:15:22')
---
    function addNotification($data) {

        $builder = $this->db->table('notifications');
        $builder->insert($data);

SELECT *
FROM `notifications`
WHERE `user_id` = 64
ORDER BY `id` DESC
---
    function notifications($userId) {

        $builder = $this->db->table('notifications');
        return $builder->where('user_id', $userId)
                ->orderBy('id', 'DESC')
                ->get()
                ->getResultArray();

SELECT *
FROM `contacts`
WHERE `user_id` = '65'
OR `target_id` = '65'
---
    function getContact($id) {
        $builder = $this->db->table('contacts');
        return $builder->where('user_id', $id)
                ->orWhere('target_id', $id)
                ->get()
                ->getResultArray();

SELECT *
FROM `users`
WHERE `id` != 65
AND  `username` LIKE '%Hype%' ESCAPE '!'
---
    function searchUsers($keyword, $userId/*, $pageIndex, $count*/) {

        $postData = $this->builder
                ->where('id !=', $userId)
                ->like('username', $keyword)

SELECT *
FROM `follow`
WHERE `user_id` = 64
---
    function getFollowers($userId) {

        $builder = $this->db->table('follow');
        return $builder->where('user_id', $userId)
                ->get()
                ->getResultArray();